/**
 * @program: Test
 * @ClassName Answer.java
 * @description: TODO
 * @author: Jun
 * @version: 1.0.0
 * @create: 2019-11-07 13:31
 */
public class Answer {
    public static void main(String[] args) {
        //String input = "begin_begin|343_C|313_B|322_C|125_D|309_B|168_B|30_D|340_D|290_B|2_B|234_C|145_C|257_D|252_C|214_B|251_A|25_B|249_C|262_C|332_A|114_B|20_C|175_D|67_D|89_A|256_B|278_B|219_C|337_D|328_A|294_B|147_C|267_A|29_A|250_C|203_D|181_C|318_C|288_A|79_D|511_A,B,C|493_A,B,C,D|560_A,B|578_A,B,C|425_A,C,D|353_A,B,C,D|388_A,B,C,D|574_A,B,C,D|484_A,B,C,D|377_A,B,C|442_A,B,D|508_A,B,C,D|371_A,B,D|585_A,C,D|477_A,B,C,D|488_A,B,C,D|399_A,B,C,D|419_A,B,C,D|416_B,C,D|451_B,C,D|855_错|614_错|876_对|643_对|715_对|960_对|837_对|603_对|777_错|912_对|706_对|731_错|826_错|818_错|695_对|741_对|958_错|621_对|900_对|886_错|925_对|910_对|671_对|815_对|807_对|675_对|846_错|968_对|737_错|763_对|793_对|789_错|904_对|749_对|718_对|627_对|804_错|673_错|814_对|847_错";
        String input = "begin_begin|228_D|285_B|202_A|311_D|347_D|324_D|227_B|241_A|42_B|73_D|17_A|293_B|247_B|218_A|22_C|5_A|297_C|3_A|210_A|113_D|85_D|305_D|40_B|48_B|76_A|35_B|329_C|277_B|32_C|124_C|323_C|19_B|70_B|232_D|229_D|281_D|343_C|117_D|339_B|45_D|490_A,C|592_A,B,C,D|519_A,B,C,D|512_A,C,D|527_A,B,D|358_A,B,C,D|551_A,B,C,D|401_A,B,C,D|352_A,B,C,D|458_A,B,C,D|542_A,B,C|468_A,B,C,D|373_A,B,C,D|570_A,B,C,D|569_A,B,C|514_A,B,C,D|403_A,B,C,D|537_A,B,C,D|431_A,B,C,D|529_A,D|763_对|787_对|961_对|975_对|991_错|635_错|846_错|898_对|631_对|669_错|957_错|633_错|688_对|822_错|897_错|980_对|697_对|929_错|613_对|778_对|860_对|765_错|873_对|956_错|811_错|739_对|884_错|768_对|924_对|662_对|663_错|683_对|827_错|890_对|885_对|626_错|761_错|695_对|889_对|748_对";
        String [] output = input.split("\\|");
        for(int i=0;i<output.length;i++) {
            System.out.printf("%10s ", output[i].split("_")[1]);
            if (i % 8 == 0)
                System.out.printf("\n");
        }

    }
}
